package game;

public class StoryTelling {
    //TODO Да създадем метод за описание на героите.
    public static void sphinxRiddleStory(int num) {
        switch (num) {
            case 1:
                System.out.println("Which creature has one voice and yet becomes four-footed and two-footed and three-footed?");
                break;
            case 2:
                System.out.println("There are two sisters: one gives birth to the other and she, in turn, gives birth to the first. Who are the two sisters?");
                break;
            // TODO To added from Rado The Great;
        }
    }

    public static void mountainHeroInfo() {
        System.out.println("В планинския свят съществуваше герой на име Марко, който беше благословен със супер сила - хипер вентилация. \n" +
                "Хипер вентилацията помага на Крали Марко да е по - издръжлив и увеличава жизнеността му.\n" +
                "Крали Марко изкачваше Високата планина не случайно, в търсенена на местното чудовище - Голямата стъпка, което е пленило прицесата.\n " +
                "Докато крачеше нагоре в далечината видя стар овчар. Това не беше случайна среща.\n" +
                " Мъдрият овчар разкрива местоположението на чудовището, но първо  трябва да премине през 2 изпитания за да събере парчета от картата. "
        );
    }

    public static void seaHeroInfo() {
        System.out.println("След пристигането на острова, Triton The Great се запознава с местните жители,\n " +
                "които му разказват за легендата за страховитото чудовище, което обитава острова, на име ДАГОН.\n" +
                " Те разказват и за принцесата на острова, която е била отвлечена от чудовището, заедно със съкровището.\n" +
                "Героят решава да помогне е на местните жители и да спаси принцесата.\n " +
                "За да разбере къде се намира принцесата, трябва да събере всички 4 парчета от картата.\n " +
                "За първите 3 части трябва да изпълни 3 мисии. Последното парче от картата е при чудовището,\n " +
                " което трябва да победи, за да вземе последната част от картата.");
    }

    public static void madInfo() {
        System.out.println(" След пристигането в пустинята, героят Mad Max се сблъсква с местните жители,\n" +
                " които му разказват за легендата за страшното чудовище - Свинкса.\n " +
                "Те споделят историята за принцесата на пустинята, която е била пленена от Свинкса, заедно със скъпоценното съкровище на пустинята.\n" +
                " Героят се обещава да помогне на местните жители и да освободи принцесата.\n" +
                "За да разбере местоположението на принцесата, Mad Max трябва да събере двете части от загадъчната карта.\n " +
                "Той трябва да изпълни две изключително опасни мисии в пустинята, изискващи смелост и интелигентност.\n" +
                "След успешното изпълнение на тези мисии, Маd Max получава липсващите парчета от картата.\n" +
                " Но най-трудната част остава пред него - да се изправи срещу Свинкса и да го победи, за да спаси принцесата.\n" +
                " Получава липсващите парчета от картата.");
    }
    public static void printIntroduction(Hero hero){
        switch (hero){
            case SEA_HERO -> seaHeroInfo();
            case LA_AREA_HERO -> madInfo();
            case MOUNTAIN_HERO -> mountainHeroInfo();
        }
    }

}

